Repository: Jiofef/Partlyx
Catalog: Partlyx.UI.Avalonia/Resources/Strings/Strings.*.resx
Languages: ru_ru

source: Clear search text
ru_ru: Очистить текст в поиске

source: Collapse all
ru_ru: Свернуть всё

source: Create
ru_ru: Создать

source: Expand all
ru_ru: Развернуть всё

source: Parts tree
ru_ru: Дерево элементов

source: Search...
ru_ru: Поиск...

source: Delete
ru_ru: Удалить

source: Expand branch
ru_ru: Развернуть ветку

source: Collapse branch
ru_ru: Свернуть ветку

source: Find in tree
ru_ru: Найти в дереве

source: Find setted resource in tree
ru_ru: Найти ресурс компонента в дереве

source: Return to the tree root
ru_ru: Вернуться к корню дерева

source: Zoom in
ru_ru: Приблизить

source: Zoom out
ru_ru: Отдалить

source: Properties
ru_ru: Свойства

source: Select
ru_ru: Выбрать

source: Cancel
ru_ru: Отмена

source: File
ru_ru: Файл

source: Save
ru_ru: Сохранить

source: Save as...
ru_ru: Сохранить как...

source: Open
ru_ru: Открыть

# menu_Edit
source: Edit
ru_ru: Правка

source: Undo
ru_ru: Отменить

source: Redo
ru_ru: Вернуть

# resource_properties_annotation
source: "{0}" resource
ru_ru: Ресурс "{0}"

# recipe_properties_annotation
source: "{0}" recipe
ru_ru: Рецепт "{0}"

# recipe_component_properties_annotation
source: "{0}" {1} component
ru_ru: Компонент "{0}" {1}

source: Name
ru_ru: Имя

source: Product amount
ru_ru: Получаемое количество

source: Selected recipe
ru_ru: Выбранный рецепт

source: Default recipe
ru_ru: Стандартный рецепт

source: Resource
ru_ru: Ресурс

source: Recipe
ru_ru: Рецепт

source: Component
ru_ru: Компонент

# Recipe_N
source: Recipe {0}
ru_ru: Рецепт {0}

# Resource_N
source: Resource {0}
ru_ru: Ресурс {0}

# Component_N
source: Component {0}
ru_ru: Компонент {0}

source: The button that does the weird thing
ru_ru: Кнопка, которая делает странные вещи

# postfix_funny_programm_for_interesting_things
source: funny programm for interesting things
ru_ru: весёлая прога для интересных вещей

# postfix_Send_my_regards_to_David___
source: Send my regards to David :D
ru_ru: Давиду привет :D

# postfix_you_forgot_to_save
source: you forgot to save <:(
ru_ru: вы забыли сохранить <:(

source: Do you want to save your file before creating a new one?
ru_ru: Вы хотите сохранить файл перед созданием нового?

# Do_you_want_to_save_your_file_before_opening_another_one
source: Do you want to save your file opening another one?
ru_ru: Вы хотите сохранить файл перед открытием другого?

source: The file is not saved
ru_ru: Файл не сохранён

source: Details:
ru_ru: Подробнее:

source: Do you want to save your file before leaving?
ru_ru: Вы хотите сохранить файл перед выходом?

source: Saving error
ru_ru: Ошибка сохранения

source: Invalid file error
ru_ru: Ошибка: невалидный файл

source: An error occured during opening a file. File wasn't opened
ru_ru: При открытии файла возникла ошибка. Файл не был открыт

source: An error occured during saving a file. File wasn't saved
ru_ru: Во время сохранения файла возникла ошибка. Файл не получилось сохранить

# filter_Partree_files
source: Partree files (*.partree)|*.partree|All files (*.*)|*.*
ru_ru: Файлы Partree (*.partree)|*.partree|Все файлы (*.*)|*.*

# partree_Open_Project
source: Open Project (.partree)
ru_ru: Открыть проект (.partree)

# partree_Save_Project
source: Save Project (.partree)
ru_ru: Сохранить проект (.partree)

source: Open in editor
ru_ru: Открыть в редакторе

source: Create a recipe for this resource
ru_ru: Создать рецепт для этого ресурса

source: Create a component for this recipe
ru_ru: Создать компонент для этого рецепта

source: Set as default
ru_ru: Установить как стандартный

# Create_resource
source: Create a resource
ru_ru: Создать ресурс

source: Toggle focus
ru_ru: Переключить фокус

source: Settings
ru_ru: Настройки

# App_Settings
source: Application settings
ru_ru: Настройки приложения

# settings_General
source: General
ru_ru: Общие

source: Apply
ru_ru: Применить

source: Ok
ru_ru: Ок

source: Language
ru_ru: Язык

source: Invalid image error
ru_ru: Ошибка: невалидное изображение

source: An error occured during loading an image Image wasnt loaded
ru_ru: При загрузке изображения возникла ошибка. Изображение не было загружено

source: Load image
ru_ru: Загрузить изображение

# filter_Image_files
source: Images (*.png;*.jpg;*.jpeg;*.webp)|*.png;*.jpg;*.jpeg;*.webp
ru_ru: Изображения (*.png;*.jpg;*.jpeg;*.webp)|*.png;*.jpg;*.jpeg;*.webp

source: Icon
ru_ru: Иконка

source: Selected icon
ru_ru: Выбранная иконка

source: Icon color
ru_ru: Цвет иконки

source: Built in icons
ru_ru: Встроенные иконки

source: User icons
ru_ru: Пользовательские иконки

source: Icons
ru_ru: Иконки

source: Show all built in icons
ru_ru: Показать все встроенные иконки

source: Project
ru_ru: Проект

source: Help
ru_ru: Справка

source: View help
ru_ru: Посмотреть справку

source: About us
ru_ru: О нас

# info_text_About_Us
source: Partlyx Version: 1.0.0 License: MIT Developed by Jiofef (Artyom Stepanov)
ru_ru: Partlyx Версия: 1.0.0 Лицензия: MIT Разработал Jiofef (Артём Степанов)

# help_HowToUsePartlyx
source: How to use Partlyx
ru_ru: Как использовать Partlyx

# help_What_is_Partlyx
source: What is Partlyx
ru_ru: Что такое Partlyx

# help_Some_QOL_Features
source: Some Quality Of Life features
ru_ru: Некоторые фичи для удобства

# help_text_What_is_Partlyx
source: Partlyx allows you to create schematics (recipes) of varying complexity, composed of components that can be any previously created resources. What does Partlyx do? * Allows you to describe entities as a dependency graph * Visualizes a multi-level structure * Calculates total cost / weight / value across the entire graph * Allows you to find possible conversions between different resources * Works with abstract resource types
ru_ru: Partlyx позволяет вам создавать схемы (рецепты) разной сложности, состоящие из компонентов, коими могут быть любые ранее созданные ресурсы. Что делает Partlyx? * Позволяет описывать сущности как граф зависимостей * Визуализирует многоуровневую структуру * Считает суммарную стоимость/вес/цену по всему графу * Работает с абстрактными типами ресурсов

# help_text_Some_QOL_Features
source: Some complex or time-consuming actions can be simplified * You can grab any part in the Parts Tree with the mouse and perform certain actions by releasing (dropping) it onto another compatible UI element. ** You can drop a grabbed recipe onto the "Default Recipe" property of a resource. If the recipe is compatible, it will be assigned to that property. ** You can drop a grabbed recipe onto the "Selected Recipe" property of a component. If the recipe is compatible, it will be assigned to that property. ** Similar to the previous ones, you can drop the captured resource over the "Input resource" and "Output resource" options in the resource converter. ** You can drag and drop the captured resource onto the "Inputs" or "Outputs" group in the recipe, and the resource will be added there as a component. You can also do this by dragging and dropping the captured resource onto the recipe node in the graph. ** While dragging a part, hovering over parts in the tree for a short time will automatically expand their list of child parts. ** While dragging a part, hovering over the focus button (eye icon) of parts will automatically activate it. * The application supports hotkeys. They are displayed when you hover the mouse over the corresponding action (button or menu item) and wait briefly. ** In addition, some actions have hotkeys but no direct UI buttons. For example, the camera in the graph can be moved using the arrow keys (Up, Down, Left, Right). Holding Shift speeds up movement, while Ctrl slows it down. * You can select multiple parts in the tree by holding Ctrl
ru_ru: Некоторые сложные или долгие действия могут быть упрощены * Вы можете схватить любой элемент в дереве мышкой и выполнять некоторые действия, если отпустить (бросить) схваченный элемент над другим подходящим элементом интерфейса ** Вы можете бросить схваченный рецепт над свойством "Стандартный рецепт" у ресурса, и, если рецепт подходящий, он выставится в свойстве ** Вы можете бросить схваченный рецепт над свойством "Выбранный рецепт" у компонента, и, если рецепт подходящий, он выставится в свойстве ** Вы можете бросить схваченный ресурс над рецептом, и тогда ресурс добавится в рецепт, как компонент. Это же можно сделать и если бросить схваченный ресурс над узлом рецепта в графе (самый верхний узел) ** Если вы схватили элемент, наведение на элементы дерева в течении короткого времени раскрывают список их дочерних элементов ** Если вы схватили элемент, наведение на кнопку фокуса (глазик) элементов автоматически активирует её * В приложении есть горячие клавиши. Они отображаются, если навестись на соответствующее действие (кнопку или пункт в меню) мышкой и немного подождать. ** Кроме этого, есть некоторые действия, для которых предусмотрены клавиши, но нет прямых кнопок в интерфейсе. Например, камеру в графе можно перемещать с помощью стрелок "Вверх, вниз, влево, вправо". Зажатый Shift ускоряет передвижение, а Ctrl замедляет. * Вы можете выделять несколько элементов в дереве, если зажат Ctrl

# help_Help
source: Help
ru_ru: Справка

source: Find resource
ru_ru: Найти ресурс

source: Find recipe
ru_ru: Найти рецепт

source: Find component
ru_ru: Найти компонент

source: Other
ru_ru: Другое

# Other2
source: Other
ru_ru: Другие

# icon_Empty
source: Empty
ru_ru: Пустая

# icon_Inherited
source: Inherited
ru_ru: Наследованная

source: Create resource with recipe by default
ru_ru: Создавать ресурс с рецептом по умолчанию

# Default_recipe_output_amount
source: Default recipe craft amount
ru_ru: Количество ресурса из создаваемого рецепта по умолчанию

# Default_recipe_input_amount
source: Default component quantity
ru_ru: Количество создаваемого компонента по умолчанию

# settings_Parts
source: Parts
ru_ru: Элементы

source: Rename
ru_ru: Переименовать

source: Open branch
ru_ru: Открыть ветку

# help_Parts_graph
source: Parts graph
ru_ru: Граф элементов

# help_text_Parts_graph
source: The Parts Graph is located in the center of the screen and displays recipes. * If a resource is selected, its **Default recipe** is shown. * If a recipe is selected, that recipe is shown. * If a component is selected, its parent recipe is shown. The graph visualizes all parts of the tree as nodes and displays all necessary and obtained quantities of elements, counting the quantities of components By default, the graph displays standard recipes for components, but you can change the recipe displayed for a specific component. For example, by clicking on the recipe below it in the graph You can move the camera in the graph by holding the left mouse button and dragging. Zoom in and out using the mouse wheel. By right-clicking a component in the graph, you can select "Open Branch", which will expand the Default or selected recipe of that component in the graph
ru_ru: Граф находится в центре экрана и отображает рецепты * Если выбран ресурс, показывает его стандартный рецепт * Если выбран рецепт, показывает его * Если выбран компонент, показывает его родительский рецепт Граф визуализирует все элементы дерева в виде узлов, а так же отображает все необходимые количества элементов, считая количества компонентов, а так же количества получаемых ресурсов из рецептов. По умолчанию, в графе отображаются стандартные рецепты для компонентов, но вы можете изменить отображаемый рецепт для определённого компонента. Например, кликнув по его узлу в графе Вы можете перемещать камеру в графе, зажав ЛКМ и двигая мышью. Отдалять и приближать камеру можно с помощью колёсика мыши Щёлкнув правой кнопкой мыши по компоненту в графе, вы можете выбрать опцию "Открыть ветку", что раскроет стандартный или выбранный рецепт этого компонента в графе

source: Merge same components
ru_ru: Объединить одинаковые компоненты

# Create_quantified_copy
source: Create indivisible copy
ru_ru: Создать неделимую копию

source: Error
ru_ru: Ошибка

source: Duplicate
ru_ru: Дублировать

source: Create a recipe
ru_ru: Создать рецепт

source: Create recipe
ru_ru: Создать рецепт

source: Resources
ru_ru: Ресурсы

source: Recipes
ru_ru: Рецепты

source: Inputs
ru_ru: Входы

source: Outputs
ru_ru: Выходы

source: Component creating
ru_ru: Создание компонентов
